---
kind: property
id: P:Autodesk.Revit.DB.ModelCurveArray.IsEmpty
source: html/33eed69c-3b60-4dbd-6c88-b238022c85df.htm
---
# Autodesk.Revit.DB.ModelCurveArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.